/*=====ヘッダコメント=====
*@プログラム名	：effect.h
*@説明・概要	：エフェクトについて
*@製作者	：吉田叶聖
*@更新内容	：2022/06/04
*@更新履歴	：コメント追記
*@更新者	：吉田叶聖
*/#pragma once
//*****************************************************************************
// インクルード部
//*****************************************************************************
#include "main.h"

// 関数プロトタイプ
HRESULT InitEffect();	// 初期化
void UninitEffect();	// 終了処理
void UpdateEffect();	// 更新
void DrawEffect();		// 描画

int StartEffect(XMFLOAT3 pos,XMFLOAT2 size);
