/*=====ヘッダコメント=====
*@プログラム名	：model.h
*@説明・概要	：モデル、プレイヤーについて
*@製作者	：吉田叶聖
*@更新内容	：2022/06/04
*@更新履歴	：コメント追記
*@更新者	：吉田叶聖
*/#pragma once
//*****************************************************************************
// インクルード部
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitModel(void);
void UninitModel(void);
void UpdateModel(void);
void DrawModel(void);

XMFLOAT3& GetModelPos();
bool CollisionPlayer(XMFLOAT3 pos, XMFLOAT3 scale);
