/*=====ヘッダコメント=====
*@プログラム名	：object.h
*@説明・概要	：オブジェクトについて
*@製作者	：吉田叶聖
*@更新内容	：2022/06/04
*@更新履歴	：コメント追記
*@更新者	：吉田叶聖
*/#pragma once
//*****************************************************************************
// インクルード部
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct TObject {
	XMFLOAT3	pos;		// 位置
	XMFLOAT4	col;		// 色
	XMFLOAT3	rot;		// 現在の向き
	XMFLOAT3	sclModel;			// スケール
	float		width;		// 幅
	float		height;		// 高さ
	int			idxShadow;	// 影ID
	bool		use;		// 使用しているかどうか
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitObject(void);
void UninitObject(void);
void UpdateObject(void);
void DrawObject(void);

int SetObject(XMFLOAT3 pos, float width, float height, XMFLOAT4 col);

int GetCnt();