/*=====ヘッダコメント=====
*@プログラム名	：sceneTitle.h
*@説明・概要	：タイトルシーンについて
*@製作者	：AT_12D_192_51吉田叶聖
*@更新者	：AT_12D_192_51吉田叶聖
*@更新内容	：初期制作
*@更新履歴	：2021/11/28
*/
#pragma once
//*****************************************************************************
// インクルード部
//*****************************************************************************
#include "main.h"
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitle(); // 初期化
void UninitTitle(); // 終了処理
void UpdateTitle(); // 更新
void DrawTitle(); // 描画