/*=====ヘッダコメント=====
*@プログラム名	：scene.h
*@説明・概要	：画面変異について
*@製作者	：AT_12D_192_51吉田叶聖
*@更新者	：AT_12D_192_51吉田叶聖
*@更新内容	：初期制作
*@更新履歴	：2021/11/28
*/
#pragma once
//*****************************************************************************
// インクルード部
//*****************************************************************************
#include "main.h"
//*****************************************************************************
// 定数定義
//*****************************************************************************
enum EScene
{
	SCENE_NONE = 0, // 未設定
	SCENE_TITLE,	// タイトル画面
	SCENE_RULE,		//チュートリアル画面
	SCENE_SELECT,	// ステージセレクト画面
	SCENE_GAME,	// ステージ
	SCENE_CLEAR,	//クリア画面
	SCENE_GAMEOVER,	//ゲームオーバー画面
	MAX_SCENE
};
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitScene(); // 初期化
void UninitScene(); // 終了処理
void UpdateScene(); // 更新
void DrawScene(); // 描画

void SetScene(EScene eScene); // 切替