/*=====ヘッダコメント=====
*@プログラム名	：sceneRule.h
*@説明・概要	：ルールシーンについて
*@製作者	：AT_12D_192_51吉田叶聖
*@更新者	：AT_12D_192_51吉田叶聖
*@更新内容	：初期制作
*@更新履歴	：2021/11/28
*/
#pragma once
//*****************************************************************************
// インクルード部
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitRule(void);
void UninitRule(void);
void UpdateRule(void);
void DrawRule(void);
