/*=====ヘッダコメント=====
*@プログラム名	：sceneSelect.h
*@説明・概要	：ステージセレクトについて
*@製作者	：AT_12D_192_51吉田叶聖
*@更新者	：AT_12D_192_51吉田叶聖
*@更新内容	：初期制作
*@更新履歴	：2021/11/28
*/
#pragma once
//*****************************************************************************
// インクルード部
//*****************************************************************************
#include "main.h"
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitSelect(); // 初期化
void UninitSelect(); // 終了処理
void UpdateSelect(); // 更新
void DrawSelect(); // 描画